W7D3/music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE (index) LIMIT $1  [["LIMIT", 1]]
---
  def show
    @band = Band.find_by(params[:id])